Task_1___________________________________________________________________________________________________________

list = [True, [1,2], {2:'slovar'}, 1, 8.99999, None]
for i, item  in enumerate(list, 1):
    print(f'{i}) {item} - {type(item)}')





Task_2____________________________________________________________________________________________________________

list = input('Введите  числа через 1 пробел - ').split()
a = len(list) if len(list) % 2 == 0 else len(list) - 1
list[:a:2], list[1:a:2] = list[1:a:2],  list[:a:2]
print('Результат:', list)

Task_3____________________________________________________________________________________________________________


mes = int(input('Введите в поиске месяц числом - '))
mes_dict = {1: 'январь', 2: 'феврвль', 3: 'март', 4: 'апрель', 5: 'май', 6: 'июнь', 7: 'июль', 8:'август', 9: 'сентябрь', 10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'}
str_list  = ['январь', 'феврвль','март', 'апрель',  'май',  'июнь',  'июль', 'август', 'сентябрь', 'октябрь',  'ноябрь', 'декабрь']
if mes in mes_dict:
    print(f'{mes} - это {mes_dict[mes]}' )
else:
    print('Не то ввели:)')



Task_4____________________________________________________________________________________________________________


str = input('Введите в поиск цифры через 1 пробел - ').split()
for n, i in enumerate(str, 1):
    print(n, i) if len(i) <=10 else print(n, (i[:10]))



Task_5____________________________________________________________________________________________________________



list = [1, 1, 22, 4, 4, 6, 8, 12]
vvod = int(input('Введите рейтинг в форме числа - '))
i = 0
for n in list:
    if vvod <= n:
        i += 1
list.insert(i, vvod)
print(list)



Task_6____________________________________________________________________________________________________________



off = []
naimen = {'название': '',  'цена': '', 'количество': '', 'единица измерения': ''}
analitic = {'название': [],  'цена': [], 'количество': [], 'единица измерения': []}
n = 0
while True:
    if input('для отмены работ нажать "ctrl" для ведения работ нажать "enter"').upper() == 'ctrl':
        break
    n += 1
    naimen = naimen.copy()
    for f in naimen:
        git = input(f'Ввести значение - "{f}:')
        naimen[f] = int(git) if f == 'цена' or f == 'количество' else git
        analitic[f].append(naimen[f])
    off.append((n, naimen))
    print(f'\nСтруктура\n{off}')
    print(f'\nАналитика: \n{"*" * 30}')
    for key, value in analitic.items():
        print(f'{key:>30}: {value}')
    print("*" * 30)